//
//// Stergios Morakis
//


//inventory
compass = false;
magic_wand = false;
ring = false;
key_1 = false;
key_2 = false;
key_3 = false;
key_4 = false;
key_5 = false;
mysterious_lollipop = false;

//visited
area1_visited = true;
area2_visited = false;
area3_visited = false;
area4_visited = false;
area5_visited = false;
area6_visited = false;
area7_visited = false;
area8_visited = false;

//talked
boss1_talked = false;
boss2_talked = false;
boss3_talked = false;
boss4_talked = false;
boss5_talked = false;
boss6_talked = false;

//answered
boss1_answered = false;
boss2_answered = false;
boss3_answered = false;
boss4_answered = false;
boss5_answered = false;
boss6_answered = false;

//current room
currentroom = "area0";
//
//	Cheatsheet left behind by: The Unknown Sign Painter
//
//	MAP
//
//     9
//     .
//     .
//  8..7
//     .
//     .
//  4  5..6
//  .  .
//  .  .
//  2..3
//  .
//  .
//  1
//
//	Area 1: Your Dungeon
//	Area 2: The Dark Hallway
//	Area 3: The Hall
//	Area 4: The Gnome 's Dungeon
//	Area 5: The Acolyte 's Room
//	Area 6: The Dragonborn 's Tower
//	Area 7: The Great Hall
//	Area 8: The Bed Chambers	
//	Area 9: Exit
//
//	Fastest Route:
//	1-2-3-2-4-2-3-5-6-5-7-5-3-2-4-2-1-2-3-5-7-8-7-9
//
//	pass1: 173			απάντηση στον γρίφο: Morse => "εκατονεβδομηντατρία" => "173".
//	pass2: QW7V40K		απάντηση στον γρίφο: ίδιο χρώμα γράμματα με το background της κάτω-αριστερής γωνίας.
//	pass3: 191791		απάντηση στον γρίφο: "3" => "τρία" => α=1, β=2, ... , ω=24 => "191791".
//	pass4: 10119187		απάντηση στον γρίφο: -σελίδα-παράγραφος-λέξη- => προσκοπικό εγκόλπιο => "κλίση" => α=1, β=2, ... , ω=24 => "10119187".
//	pass5: 2742372		απάντηση στον γρίφο: πρώτη γραμμή: +2, δεύτερη γραμμή: +7, τρίτη γραμμή: -4, τέταρτη γραμμή: -2, πέμπτη γραμμή: 372 => 2, 7, 4, 2, 272 => "2742372"
//	pass6: NOTES		απάντηση στον γρίφο: "W I "N#1" "T#3" "E#4" R    I "S#5"    C "O#2" M I N G" => "NOTES".
//
$("#start_game").fadeOut(300, function() {
    if ($(window).width() > 768) {
        $(".compass").fadeIn(2000);
    }
    $("#command_line").fadeIn(2000);
    $("#area_0").fadeIn(2000);
    $('<p>Σε καλωσορίζω σε μια περιπέτεια, κομμένη και ραμμένη στα προσκοπικά σου μέτρα. Πρόκειται για ένα Text-Game, γεμάτο δοκιμασίες, γρίφους και συγκινήσεις. Text-Game καλείται ένα παιχνίδι, στο οποίο η αλληλεπίδραση με τα NPCs (non playable characters), πραγματοποιείται μέσω απλών εντολών. Στο συγκεκριμένο παιχνίδι, οι εντολές που μπορείς να εκτελέσεις είναι: "go north", "go east", "go south" και "go west" για να κινηθείς βόρεια, ανατολικά, νότια και δυτικά αντίστοιχα. Πληκτρολόγησε "talk", αν θες να αλληλεπιδράσεις με το χαρακτήρα που βρίσκεται στο ίδιο δωμάτιο με εσένα. Τέλος, πάτησε "answer" κι έπειτα την απάντηση σου, προκειμένου να απαντήσεις σε κάποιον γρίφο. Φυσικά, πρέπει να βρίσκεσαι στο ίδιο δωμάτιο με το χαρακτήρα που σου έθεσε την ερώτηση, ώστε να σε ακούσει. Μη φοβάσαι μήπως τις ξεχάσεις. Σε οποιοδήποτε σημείο του παιχνιδιού μπορείς να πατήσεις "help", για να τις ξαναδείς. Τα μόνα εργαλεία που θα χρειαστείς είναι ένα προσκοπικό εγκόλπιο και πολλή φαντασία! Με μια δεύτερη σκέψη, ίσως χρειαστεί και μια επίσκεψη στη λέσχη μας, αλλά θα αργήσει αυτό το κομμάτι. Για να μπεις στην περιπέτεια, πληκρολόγησε "start" στο παρακάτω πλαίσιο και έπειτα πάτησε το "Enter" του πληκτρολογίου σου. Καλή διασκέδαση. Θα σε ξαναδω στο τέλος του παιχνιδιού.</p>').insertBefore("#add_text").fadeIn(2000);
    $('<p>-The Unknown Sign Painter</p>').insertBefore("#add_text").fadeIn(2000);
});
$("form").submit(function() {
    var input = $("#command_line").val();
    var words = input.split(' ');
    var word0 = words[0];
    var word1 = words[1];

    //
    //start
    //
    if (words.length == 1 && word0 == "start" && currentroom == "area0") {
        compass = true;
        currentroom = "area1";
        $("#area_0").fadeOut(1000, function() {
            $("#area_1").fadeIn(1000);
        });
        $('<p>Βρίσκεσαι σε ένα σκοτεινό μπουντρούμι. Δεν θυμάσαι πώς βρέθηκες εδώ. Ακούς έναν μεταλλικό ήχο και με την άκρη του ματιού σου, βλέπεις έναν αρουραίο να χάνεται στο σκοτάδι. Το αντικείμενο που αφησε πίσω του, μοιάζει με πυξίδα. Ίσως σου χρειαστεί, σκέφτεσαι, καθώς σκύβεις να την πάρεις. Στη γωνία του μπουντρουμιού, βλέπεις ένα σεντούκι. Έχει δύο υποδοχές για κλειδιά. Η δεξιά υποδοχή έχει ανάγλυφο ένα δράκο, ενώ η άλλη, η αριστερή, μια αράχνη. Αναρωτιέσαι αν αυτό το σεντούκι κρύβει το μυστικό για το λόγο που βρίσκεσαι εδώ. Η έξοδος από το μπουντρούμι, κοιτάζει προς το Βορρά. Η σιδερένια πόρτα φαίνεται ανοιχτή.</p>').insertBefore("#add_text").fadeIn(1000);
    }
    //
    //end start
    //

    //
    //help
    //
    else if (words.length == 1 && word0 == "help") {
        $('<p>---- Help Menu ----<br>go north:<br>Μετακίνησε το χαρακτήρα σου προς το Βορρά<br>go east:<br>Μετακίνησε το χαρακτήρα σου προς την Ανατολή<br>go south:<br>Μετακίνησε το χαρακτήρα σου προς το Νότο<br>go west:<br>Μετακίνησε το χαρακτήρα σου προς τη Δύση<br>talk:<br>Αλληλεπίδρασε με άλλο χαρακτήρα στο ίδιο δωμάτιο με εσένα. Ίσως να έχει κάποια αποστολή για σένα.<br>answer <i>απάντηση</i>:<br>Χρησιμοποίησε αυτήν την εντολή για να απαντήσεις σε γρίφους.<br>inventory:<br>Δες τα αντικείμενα που έχεις συλλέξει ως τώρα.<br>--------------------</p>').insertBefore("#add_text").fadeIn(1000);
    }
    //
    //end help
    //

    //
    //talk
    //
    else if (words.length == 1 && word0 == "talk") {
        if (currentroom == "area3" && boss1_talked == false) {
            boss1_talked = true;
            $('<p>Φρουρός: "Το όνομά μου είναι Λάσκερ. Όταν ήμουν νεότερος, φρόντιζα τον πατέρα μου, ενώ υπέφερε από μια κατάρα. Για να τον θεραπεύσω, έπρεπε να βρω ένα μυθικό δαχτυλίδι, το Δαχτυλίδι των Ευχών. Για το μεγάλο ταξίδι της αναζήτησής του, χρειαζόμουν χρυσό. Εν τέλει, με τίμιους και μη τρόπους, μάζεψα το χρυσό που χρειαζόμουν αν και, ήταν αργά για εκείνον. Από τότε, είμαι ένας ακόμα φύλακας του μπουντρουμιού εδώ. Με ρωτάς γιατί; Αρχικά, λόγω της κατάρας για την οποία θα μάθεις αργότερα κι έπειτα, στους μη τίμιους τρόπους για τη συλλογή χρυσών νομισμάτων ανείκει κι η προδωσία ενός καλού μου φίλου. Το λιγότερο που θα μπορούσα να κάνω σε αυτή την κατάσταση, είναι να τον φροντίζω. Αρκετά όμως είπαμε. Αν θες να συνεχίσεις, βοήθησε με να αποκρυπτογραφίσω αυτό το μήνυμα. Έχω ξεχάσει τον τρόπο αποκωδικοποίησής του και φαίνεται σημαντικό."</p>').insertBefore("#add_text").fadeIn(1000);
            $(".msg").fadeIn(1000, function() {
                $("#msg1").fadeIn(1000);
            });
        } else if (currentroom == "area3" && boss1_talked == true && boss1_answered == false) {
            $('<p>Λάσκερ: "Φαίνεται κώδικας ΜΟΡΣ. Αναρωτιέμαι αν αυτή είναι η μοναδική κωδικοποίηση."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area3" && boss1_talked == true && boss1_answered == true && boss6_answered == false) {
            $('<p>Λάσκερ:  "...". Θα κοιμάται βαθιά.</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area3" && boss1_talked == true && boss1_answered == true && boss6_answered == true) {
            $('<p>Λάσκερ:  "..! Ο πατέρας μου ζει! Πρέπει να τον βρω."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area4" && boss2_talked == false) {
            boss2_talked = true;
            $('<p>Γνώμος: "Καλημέρα, καλησπέρα, καληνύχτα!" λέει το πλάσμα ή μάλλον, φωνάζει με τη ψιλή του φωνή, ενώ γελάει δυνατά. "Είμαι η Μοίρα. Ο τελευταίος Γνώμος σε όλο τον κόσμο! Είμαστε πάντα χαρούμενοι και γελαστοί εμείς οι Γνώμοι! Και μικροσκοπικοί επίσης! Δεν θυμάμαι πως βρέθηκα εδώ ,αλλά περνάω υπέροχα! Μόνο που δεν έχουν γλυφιτζούρια εδώ. Τυχαίνει να έχεις; Πριν συνεχίσεις το ταξίδι σου, πες μου τον κωδικό που έχω κρυμμένο με μαγεία στο δωμάτιο μου. Φυσικά, η ανταμοιβή σου θα είναι μαγικά πλουσιοπάροχη!"</p>').insertBefore("#add_text").fadeIn(1000);
            $(".msg").fadeIn(1000, function() {
                $("#msg2").fadeIn(1000);
            });
        } else if (currentroom == "area4" && boss2_talked == true && boss2_answered == false) {
            $('<p>Μοίρα: "Χιχι! Η απάντηση είναι πιο κοντά από όσο νομίζεις!"</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area4" && boss2_talked == true && boss2_answered == true && mysterious_lollipop == false && key_4 == false) {
            $('<p>Μοίρα: "Χαχα! Πεινάω! Θέλω ένα νόστιμο γλυφιτζούρι! Θα μου βρεις;"</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area4" && boss2_talked == true && boss2_answered == true && mysterious_lollipop == true && key_4 == false) {
            key_4 = true;
            mysterious_lollipop = false;
            $('<p>Μοίρα: "Το θυμήθηκες! Είσαι καλός πρόσκοπος! Πάρε αυτό το κλειδί."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area4" && boss2_talked == true && boss2_answered == true && mysterious_lollipop == false && key_4 == true && boss6_answered == false) {
            $('<p>Μοίρα: "Από τα καλύτερα γλυφιτζούρια της ζωής μου! Γιαμ γιαμ!"</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area4" && boss2_talked == true && boss2_answered == true && mysterious_lollipop == false && key_4 == true && boss6_answered == true) {
            $('<p>Μοίρα: "Τα θυμήθηκα όλα! Δεν είμαι ο τελευταίος Γνώμος στον κόσμο! Αλλά συνήθισα εδώ. Νομίζω τελικά, πως θέλω να μείνω."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area5" && boss3_talked == false) {
            boss3_talked = true;
            $('<p>Άγνωστος άνδρας: "Με καλούν Εννέα, τον καντηλανάφτη του κάστρου. Έρχομαι από ένα πολύ μακρινό χωριό, κρυμμένο μέσα στα δάση. Οι κάτοικοι εκεί χρησιμοποιούν, ή μάλλον χρησιμοποιούσαν, τη μαγεία για καλούς σκοπούς. Ήταν, βλέπεις, ελεύθεροι και ειρηνικοί. Θυμάμαι να ποτίζουμε με μαγεία διάφορα αντικείμενα, όπως πιάτα που δεν άδειαζαν ποτέ από φαγητό και τυχερά φίλτρα. Αλλά όπως παντού, έτσι και στη μαγεία, το πιο λαμπερό άστρο, δημιουργεί την πιο σκοτεινή σκιά, τις κατάρες. Έτσι, μέσα σε μια νύχτα, δημιουργήθηκε το πρώτο αντικείμενο, που η ίδια η μαγεία σέβεται, το Δαχτυλίδι των Ευχών. Ένα αντικείμενο δημιουργημένο να διώξει τα λάθη του παρελθόντος. Αλλά αυτός είναι απλά ένας μύθος. Για να συνεχίσεις το ταξίδι σου πρέπει να μου απαντήσεις σε μια ερώτηση. Η απάντηση δεν είναι τόσο απλή όσο φαίνεται. Αν ρίχνει κανείς ένα βέλος κάθε τριάντα δευτερόλεπτα, πόσα θα έχει ρίξει σε ένα λεπτό;"</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area5" && boss3_talked == true && boss3_answered == false) {
            $('<p>Εννέα: "Ο χρόνος κυλάει. Αν ρίχνει κάποιος ένα βέλος κάθε τριάντα δευτερόλεπτα, πόσα θα έχει ρίξει σε ένα λεπτό;"</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area5" && boss3_talked == true && boss3_answered == true && boss6_answered == false) {
            $('<p>Εννέα: "Τί είδους κριτήρια χρησιμοποιούμε για να διαχωρίσουμε το σωστό από το λάθος;"</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area5" && boss3_talked == true && boss3_answered == true && boss6_answered == true) {
            $('<p>Εννέα: "Πως μπόρεσα να το ξεχάσω; Το άτομο που δημιούργησε το Δαχτυλίδι των Ευχών, ήμουν εγώ."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area6" && boss4_talked == false) {
            boss4_talked = true;
            $('<p>Δρακόμορφος: "Με καλούν Λάρσεν. Είμαι ο πρώτος δρακόμορφος ενός χωριού, όχι μακριά από εδώ. Αν δεν το γνώριζες ήδη, οι κακοί δρακοι έχουν σκούρα χρώματα, ενώ ανοιχτά, οι καλοί. Το χωριό εκείνο διοικούταν από έναν μωβ δρακόμορφο μάγο, τον Μόρφυ, ο οποίος βασάνιζε τους χωρικούς με όλο και υψηλότερους φόρους και καταστρέφοντας τις σοδειές τους. Ήταν τύραννος του χωριού για πάρα πολύ καιρό, μέχρι την ημέρα που έπεσε ο μετεωρίτης της προφητείας πάνω του. Από τον μετεωρίτη, βγήκαν πράσινες φλόγες, που σιγοέψηναν τα άψυχα πια λέπια του, χωρίς να σβήνουν ποτέ. Κάτι τέτοιο γέμιζε με όλο και περισσότερο μίσος του χωρικούς. Δεν πέρασε πολύς καιρός, μέχρι την ημέρα που οι χωρικοί στράφηκαν εναντίον μου καθώς, πίστευαν πως θα ακολουθούσα τα χνάρια του πατέρα μου. Προδομένος, ζήτησα τη βοήθεια ενός παιδικού μου φίλου, αλλά προδόθηκα για δεύτερη φορά. Κι έτσι, έχασα την πίστη μου στους ανθρώπους. Έχω αποδεχτεί τη μοίρα που όρισε ο πατέρας μου για εμένα τον ίδιο. Πώς; Είσαι πρόσκοπος; Έχω ακούσει μια προφητεία για έναν πρόσκοπο. Ανέφερε πως η απάντηση στους αριθμούς 204, 2 και 9 θα έδιωχναν τις σκιές του σκοταδιού. Πρέπει να αφορά ένα βιβλίο που έχετε εσείς οι πρόσκοποι."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area6" && boss4_talked == true && boss4_answered == false) {
            $('<p>Λάρσεν: "Η προφητεία μίλαγε για έναν πρόσκοπο που θα βρει τι σημαίνουν οι αριθμοί 204, 2 και 9. Εύχομαι να είσαι εσύ αυτός."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area6" && boss4_talked == true && boss4_answered == true && boss6_answered == false) {
            $('<p>Λάρσεν: "Αναντίρρητα, είσαι ο πρόσκοπος της προφητείας. Δεν περίμενα τίποτα λιγότερο από εσένα."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area6" && boss4_talked == true && boss4_answered == true && boss6_answered == true) {
            $('<p>Λάρσεν: "Ήταν ο Λάσκερ. Ο παιδικός μου φίλος. Ώστε, για το λόγο αυτό με φρόντιζε τόσο καιρό. Πρέπει να μάθει πως τον έχω συγχωρήσει."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area7" && boss5_talked == false) {
            boss5_talked = true;
            $('<p>Φρουρός: "Ονομάζομαι Ίριδα. Μεγάλωσα στο κάστρο αυτό. Με φρόντισε ο αφέντης του κάστρου, όταν με εντόπισε ως βρέφος σε ένα κοντινό ποτάμι, μόνη σε μια βάρκα. Αλλά πάνε χρόνια από τότε. Αρχίζω να ξεχνάω πως ήταν η ζωή πριν δέσει το κάστρο μας, η κατάρα εκείνης της νύχτας. Από τότε, είμαστε εγκλωβισμένοι εδώ αλλά τουλάχιστον, το ίδιο ισχύει και για την κατάρα. Αν φύγουμε, η κατάρα θα εξαπλωθεί παντού, σε όλο τον κόσμο. Να βοηθήσεις; Αν και φαίνεται να έχεις καλό σκοπό, ή μάλλον, ακριβώς επειδή έχεις καλό σκοπό, δεν μπορώ να σου επιτρέψω να περάσεις. Τουλάχιστον όχι πριν μου αποδείξεις πως μπορείς να λύσεις αυτόν τον γρίφο."</p>').insertBefore("#add_text").fadeIn(1000);
            $(".msg").fadeIn(1000, function() {
                $("#msg3").fadeIn(1000);
            });
        } else if (currentroom == "area7" && boss5_talked == true && boss5_answered == false) {
            $('<p>Ίριδα: "Λύσε τον γρίφο αν θες να περάσεις."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area7" && boss5_talked == true && boss5_answered == true && boss6_answered == false) {
            $('<p>Ίριδα: "Ενθουσιάζομαι με την ιδέα πως μια μέρα θα μπορέσω να φύγω από το κάστρο και να δω ένα μονοπάτι απο ατέλειωτα βασιλέματα. Εύχομαι να έδιωχνε κάποιος αυτήν την κατάρα."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area7" && boss5_talked == true && boss5_answered == true && boss6_answered == true) {
            $('<p>Ίριδα: "Μετά από τόσο καιρό, είμαι ελεύθερη."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area8" && boss6_talked == false) {
            boss6_talked = true;
            $('<p>Πνεύμα του σκοταδιού: "Δεν υπάρχει λόγος να φοβάσαι, ξένε. Είσαι επισκέπτης στο κάστρο μου. Πριν πάρω τη μορφή που αντικρίζεις τώρα, το όνομά μου ήταν Έρεν. Ήμουν ένας πρίγκηπας κι αυτή, είναι η ιστορία μου. Πριν πολλά χρόνια, μια βροχερή νύχτα, εμφανίστηκε μια ηλικιωμένη γυναίκα στην πύλη του κάστρου. Μου ζήτησε καταφύγιο, μα εγώ αρνήθηκα. Η γυναίκα τότε, μεταμορφώθηκε σε μια δρακόμορφη μάγισσα και με καταράστηκε. Με μετέτρεψε σε αυτή τη μορφή και έκλεψε τις αναμνήσεις όλων μέσα στο κάστρο. Είμαστε παντοτινά εγκλώβισμένοι μέσα σε αυτούς τους πέτρινους τοίχους καθώς, τρέμουμε στην ιδέα πως αν φύγουμε, η κατάρα θα σπείρει το χάος στο μαγικό μας κόσμο. Ο μόνος τρόπος για να λυθεί η μαγεία αυτή, είναι να μου πει κάποιος τη μαγική λέξη μέχρι την αλλαγή της χρονιάς. Αν λοιπόν, δεν το καταφέρει κανείς αυτό, τότε τα μάγια θα κρατήσουν για πάντα και το ίδιο κι οι ελπίδες μου."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area8" && boss6_talked == true && boss6_answered == false) {
            $('<p>Έρεν: "Angels barished frem heaven, have no choice, bur to bicome devilz."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area8" && boss6_talked == true && boss6_answered == true) {
            $('<p>Έρεν: "Είσαι ελεύθερος να φύγεις. Λυπάμαι που δε θα σε ξαναδώ, φίλε μου."</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area0") {
            $('<p>Για να ξεκινήσει η περιπέτειά σου, πάτησε "start".</p>').insertBefore("#add_text").fadeIn(1000);
        } else $('<p>Δεν σε ακούει κανένας.</p>').insertBefore("#add_text").fadeIn(1000);
    }
    //
    //end talk
    //

    //
    //answer
    //
    else if (words.length == 2 && word0 == "answer") {
        if (currentroom == "area3" && boss1_talked == true && boss1_answered == false) {
            if (word1 == "173") {
                key_1 = true;
                boss1_answered = true;
                $('<p>Λάσκερ: "Φαίνεται σωστό. Πάρε αυτό το κλειδί. Λέω να συνεχίσω τον ύπνο μου τώρα."</p>').insertBefore("#add_text").fadeIn(1000);
                $("#msg1").fadeOut(1000, function() {
                    $(".msg").fadeOut(1000);
                });
                $('<p>Λάσκερ: "..."</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Λάσκερ: "Η τελική απάντηση πρέπει να είναι αριθμοί, αν θυμάμαι σωστά."</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area4" && boss2_talked == true && boss2_answered == false) {
            if (word1 == "QW7V40K") {
                magic_wand = true;
                key_2 = true;
                boss2_answered = true;
                $("#msg2").fadeOut(1000, function() {
                    $(".msg").fadeOut(1000);
                });
                $('<p>Μοίρα: "Bingo! Χαχα! Πάρε αυτό το ραβδί παγωμένων εκρήξεων. Στάσου! Έπεσε από έναν φρουρό κι αυτό το κλειδί! Κράτησέ το, για να με θυμάσαι!"</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Μοίρα: "Χαχα! Έχεις πλάκα! Σκέφτηκες να ρίξεις μια ματιά στο σκοτάδι;"</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area5" && boss3_talked == true && boss3_answered == false) {
            if (word1 == "191791") {
                boss3_answered = true;
                $('<p>Εννέα: "Ορθή απάντηση. Πέρασε."</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Εννέα: "Η απάντηση στον γρίφο πρέπει να κωδικοποιηθεί. Η τελική απάντηση πρέπει να είναι έξι αριθμοί."</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area6" && boss4_talked == true && boss4_answered == false) {
            if (word1 == "10119187") {
                boss4_answered = true;
                area5_visited = false;
                $('<p>Μπαίνει ένα εκτυφλωτικό φως από το παράθυρο του πέτρινου πύργου. Περνάει δύο φορές από γύρω σου και χάνεται στις σκάλες, από όπου ήρθες. Για κάποιον ανεξήγητο λόγο, νιώθεις κάτι διαφορετικό. Ακούς τον ήχο μιας πόρτας να ανοίγει.</p>').insertBefore("#add_text").fadeIn(1000);
                $('<p>Λάρσεν: "Η προφητεία ήταν αληθινή. Πες μου ξένε. Αν είχαμε γνωριστεί νωρίτερα στις ζωές μας, θα μπορούσαμε να είμαστε φίλοι;"</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Λάρσεν: "Η απάντηση στην προφητεία είναι οκτώ αριθμοί."</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area7" && boss5_talked == true && boss5_answered == false) {
            if (word1 == "2742372") {
                key_3 = true;
                boss5_answered = true;
                $('<p>Ίριδα: "Μου απέδειξες πως μπορείς να συνεχίσεις. Σου δίνω αυτό το κλειδί, ώστε καμια κατάρα του κάστρου να μην μπορέσει να σε αμφισβητήσει."</p>').insertBefore("#add_text").fadeIn(1000);
                $("#msg3").fadeOut(1000, function() {
                    $(".msg").fadeOut(1000);
                });
            } else {
                $('<p>Ίριδα: "Η απάντησή σου δεν είναι σωστή. Κοίταξε πιο προσεκτικά."</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area8" && boss6_talked == true && boss6_answered == false) {
            if (word1 == "NOTES") {
                key_5 = true;
                boss6_answered = true;
                $('<p>Το πνεύμα είχε στερέψει από ελπίδα κι όμως, τώρα χαμογελάει, καθώς παίρνει ανθρώπινη μορφή. Είναι ελεύθερο.</p>').insertBefore("#add_text").fadeIn(1000);
                $('<p>Έρεν: "Ένιωθα πως ζούσα έναν εφιάλτη, από τον οποίο δε θα ξύπναγα ποτέ. Πριν μου δείξεις το δρόμο, δεν με ένοιαζε. Απάθεια. Όταν κάποιος παύει να έχει επιλογές, παύει να είναι και άνθρωπος. Αλλά ύστερα εμφανίστηκες εσύ κι όλα άλλαξαν. Μου θύμησες πως οι ανθρώπινες σχέσεις αλλάζουν. Εξελίσσονται. Κι αυτή εδω, η δική μας, έχει γίνει αρκετά βαθιά. Το κλειδί του κάστρου είναι δικό σου. Είσαι ελεύθερος."</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Έρεν: "Ο δημιουργός του παιχνιδιού. Αυτός έχει την απάντηση."</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area0") {
            $('<p>Για να ξεκινήσει η περιπέτειά σου, πάτησε "start".</p>').insertBefore("#add_text").fadeIn(1000);
        } else $('<p>Απαντάς σε ερωτήσεις που δεν υπάρχουν.</p>').insertBefore("#add_text").fadeIn(1000);

    }
    //
    //end answer
    //

    //
    //go
    //
    else if (words.length == 2 && word0 == "go") {
        if (currentroom == "area1") {
            if (word1 == "north" && area2_visited == false) {
                area2_visited = true;
                currentroom = "area2";
                $("#area_1").fadeOut(1000, function() {
                    $("#area_2").fadeIn(1000);
                });
                $('<p>Ακολουθείς πιστά την πυξίδα και το ένστικτό σου, ώστε να ξεφύγεις από αυτό το περίεργο μέρος. Μετά από λίγα μόλις βήματα, ένας άγριος θάμνος, από το πουθενά, κλείνει το πέρασμα πίσω σου. Κανένας λογικός άνθρωπος δε θα επιχειρούσε να περάσει μέσα από αυτά τα απειλητικά και κοφτερά αγκάθια. Αλήθεια, πιστεύεις στη μαγεία; Ίσως είναι η κατάλληλη στιγμή για να πιστέψεις, τώρα που είναι νωρίς. Διασχίζεις έναν μακρύ, στενό και σκοτεινό διάδρομο με λίγους μόνο δαυλούς, σαν πηγή φωτός, αλλά αρκετούς ώστε να βρεις εύκολα το δρόμο σου. Ξαφνικά, στα αριστερά σου, από εκεί όπου η πυξίδα σου δείχνει τη Δύση, βλέπεις τον τοίχο να χάνεται στις σκιές. Τη θέση του παίρνει ένας καθρέφτης. Μέσα στον καθρέφτη, βλέπεις έναν φωτεινό πολεμιστή να μάχεται με πλάσματα του σκοταδιού. Προσπαθείς να φωνάξεις, μα δεν σε ακούει. Αποφασίζεις να σπάσεις τον καθρέφτη. Οι σκιές όμως, τον καλύπτουν και πλέον μπορείς να διακρίνεις μόνο έναν ακόμα άψυχο και πέτρινο τοίχο. Αναρωτιέσαι ποια μπορεί να ήταν εκείνη η φιγούρα. Δύο ξύλινες, βαριές πόρτες εμφανίζονται στο τέλος του διαδρόμου, η μια προς το Βορρά και η άλλη κοιτάζει την Ανατολή.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area2_visited == true) {
                currentroom = "area2";
                $("#area_1").fadeOut(1000, function() {
                    $("#area_2").fadeIn(1000);
                });
                $('<p>Ο άγριος, μαγικός θάμνος προσπαθεί να σε εμποδίσει. Χρησιμοποιείς το μαγικό ραβδί των παγωμένων εκρήξεων. Λίγες παγωμένες εκρήξεις είναι αρκετές για να ανοίξει ένα μικρό πέρασμα, ώστε να περάσεις. Αφού περάσεις, τα κλαδιά εξαπλώνονται και ξανακλείνουν το πέρασμα, πίσω σου. Ακολουθείς τους δαυλούς. Οι νυχτερίδες δεν σε τρομάζουν πια. Τις έχεις συνηθίσει. Φτάνεις στο τέλος του διαδρόμου, όπου βρίσκονται οι δύο πόρτες.</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Δεν μπορείς να περάσεις μέσα από τον τοίχο. Η μόνη έξοδος είναι προς το Βορρά. Για βοήθεια, σχετικά με τις εντολές, πάτησε "help".</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area2") {
            if (word1 == "north" && area4_visited == false && key_1 == false) {
                $('<p>Η βόρεια πόρτα είναι κλειδωμένη.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area4_visited == false && key_1 == true) {
                area4_visited = true;
                currentroom = "area4";
                $("#area_2").fadeOut(1000, function() {
                    $("#area_4").fadeIn(1000);
                });
                $('<p>Βάζεις το σκουριασμένο κλειδί στην πόρτα. Ταιριάζει. Ξεκλειδώνεις και σπρώχνεις προς τα μέσα. Μοιάζει με μπουντρούμι, όχι τόσο διαφορετικό από εκείνο που ήσουν αρχικά. Μέσα στο σκοτάδι, οι ακτίνες του φεγγαριού, που εισβάλλουν στο δωμάτιο από ένα μικρό παράθυρο, λούζουν μια ιδιαίτερη μορφή. Πλησιάζεις και διακρίνεις ένα μικρόσωμο πλάσμα, όχι ψηλότερο από ένα μέτρο.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area4_visited == true && boss2_talked == true) {
                currentroom = "area4";
                $("#area_2").fadeOut(1000, function() {
                    $("#area_4").fadeIn(1000);
                });
                $('<p>Με μια δεύτερη ματιά, το μπουντρούμι σου ήταν σαφώς καλύτερο από αυτό εδώ. Καλύτερα να μην της το πεις. Μοίρα: "Ξαναγύρισες! Σου έλειψα;"</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area4_visited == true && boss2_talked == false) {
                currentroom = "area4";
                $("#area_2").fadeOut(1000, function() {
                    $("#area_4").fadeIn(1000);
                });
                $('<p>Το πλάσμα σε κοιτάζει με ένα χαμόγελο ζωγραφισμένο στο πρόσωπό του."</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "east" && area3_visited == false) {
                area3_visited = true;
                currentroom = "area3";
                $("#area_2").fadeOut(1000, function() {
                    $("#area_3").fadeIn(1000);
                });
                $('<p>Ανοίγεις αργά-αργά την πόρτα, καθώς προσπαθείς να κρυφοκοιτάξεις. Βλέπεις ένα φρουρό να κοιμάται σε μια καρέκλα. Πίσω του, προς το Βορρά, βρίσκεται μια σιδερένια πόρτα. Επίσης, διακρίνεις πέντε αρχοντικές καρέκλες, γύρω από μια μικρή, αλλά επιβλητική τραπεζαρία. Ένας πολυέλαιος διακοσμεί το χώρο, ενώ μια χοντρούλα γάτα έχει ξαπλώσει δίπλα στο τζάκι. Ανοίγεις λίγο περισσότερο την πόρτα αλλά το τρίξιμο είναι αρκετό ώστε να ξυπνήσει το φρουρό.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "east" && area3_visited == true && boss1_talked == true) {
                currentroom = "area3";
                $("#area_2").fadeOut(1000, function() {
                    $("#area_3").fadeIn(1000);
                });
                $('<p>Βλέπεις τον Λάσκερ να κοιμάται."Όπως τον άφησα" σκέφτεσαι.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "east" && area3_visited == true && boss1_talked == false) {
                currentroom = "area3";
                $("#area_2").fadeOut(1000, function() {
                    $("#area_3").fadeIn(1000);
                });
                $('<p>Ο φρουρός σε κοιτάζει καχύποπτα.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "south" && magic_wand == false) {
                $('<p>Ο άγριος, μαγικός θάμνος δεν σε αφήνει να συνεχίσεις το δρόμο σου. Τα αγκάθια του φαίνονται κοφτερά.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "south" && magic_wand == true) {
                currentroom = "area1";
                $("#area_2").fadeOut(1000, function() {
                    $("#area_1").fadeIn(1000);
                });
                $('<p>Ο άγριος, μαγικός θάμνος προσπαθεί να σε εμποδίσει. Βγάζεις το μαγικό ραβδί των παγωμένων εκρήξεων και το χρησιμοποιείς προς το μέρος του, ενώ φωνάζεις "Άμπρα Καντάμπρα!", χωρίς ιδιαίτερο λόγο. Κάποια κλαδιά παγώνουν, ενώ κάποια άλλα χάνονται στις φλόγες. Ανοίγει ένα πέρασμα ώστε να συνεχίσεις το δρόμο σου. Αφού περάσεις, τα κλαδιά εξαπλώνονται και ξανακλείνουν το πέρασμα, πίσω σου. Μπαίνεις στο μπουντρούμι, όπου ξεκίνησαν όλα.</p>').insertBefore("#add_text").fadeIn(1000);
                if (key_3 == true && key_4 == false) {
                    $('<p>Το κλειδί σε σχήμα δράκου ταιριάζει στην αριστερή υποδοχή του σεντουκιού. Πού μπορεί να βρίσκεται το άλλο;</p>').insertBefore("#add_text").fadeIn(1000);
                }
                if (key_3 == false && key_4 == true) {
                    $('<p>Το κλειδί σε σχήμα αράχνης ταιριάζει στη δεξιά υποδοχή του σεντουκιού. Πού μπορεί να βρίσκεται το άλλο;</p>').insertBefore("#add_text").fadeIn(1000);
                }
                if (key_3 == true && key_4 == true) {
                    ring = true;
                    $('<p>Τοποθετείς και τα δύο κλειδιά στο σεντούκι. Προσπαθείς να το ξεκλειδώσεις, αλλά τα κλειδιά δε γυρίζουν εύκολα. Αποφασίζεις να το χτυπήσεις, μήπως ανοίξει, κι εκείνο σπάει. Μέσα του, βρίσκεις ένα δαχτυλίδι. "Δαχτυλίδι Ευχών" αναγράφεται στην εσωτερική του πλευρά.</p>').insertBefore("#add_text").fadeIn(1000);
                }
            } else {
                $('<p>Ο διάδρομος έχει τρεις εξόδους. Βορρά, Ανατολή και Νότο. Για βοήθεια, σχετικά με τις εντολές, πάτησε "help".</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area3") {
            if (word1 == "north" && area5_visited == false && key_2 == false) {
                $('<p>Η πόρτα είναι κλειδωμένη.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area5_visited == false && key_2 == true) {
                area5_visited = true;
                currentroom = "area5";
                $("#area_3").fadeOut(1000, function() {
                    $("#area_5").fadeIn(1000);
                });
                $('<p>Ανοίγεις, χωρίς αντίσταση, τη σιδερένια πόρτα με το νέο σου κλειδί. Βλέπεις μια σκάλα με πλατιά σκαλιά. Από τα πλαϊνά παράθυρά, κοιτάζεις έξω. Ο Λεβάντες σε δροσίζει. Η νύχτα φαίνεται ήσυχη, μα δεν έχεις χρόνο να την απολαύσεις και συνεχίζεις. Μόλις ανέβεις τα σκαλοπάτια, εμφανίζεσαι σε ένα μικρό δωμάτιο. Αναμμένοι δαυλοί γύρω από ένα μικρό τραπέζι με δύο ξύλινες καρέκλες. Μια πόρτα βρίσκεται στη βόρεια πλευρά του δωματίου κι ένα ακόμη πέρασμα θα σε οδηγήσει προς την Ανατολή. Πάνω στο τραπέζι, μια σκακιέρα.  "Πως μπορώ να σε βοηθήσω;" ακούς από τα αριστερά σου. Παρατηρείς τον άνδρα, καθώς ανάβει με ένα κερί τον τελευταίο δαυλό του δωματίου. "Δεν θα έπρεπε να βρίσκεσαι εδώ" λέει με πιο αυστηρό ύφος.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area5_visited == true && boss3_talked == true) {
                currentroom = "area5";
                $("#area_3").fadeOut(1000, function() {
                    $("#area_5").fadeIn(1000);
                });
                $('<p>Βλέπεις τον Εννέα να σκέφτεται, πάνω στη σκακιέρα. Τα λευκά κομμάτια έχουν τρομερή επίθεση, μα τα μαύρα δεν υστερούν καθόλου στην άμυνα!</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area5_visited == true && boss3_talked == false) {
                currentroom = "area5";
                $("#area_3").fadeOut(1000, function() {
                    $("#area_5").fadeIn(1000);
                });
                $('<p>Βλέπεις τον άγνωστο άνδρα να σκέφτεται, πάνω στη σκακιέρα.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "west") {
                currentroom = "area2";
                $("#area_3").fadeOut(1000, function() {
                    $("#area_2").fadeIn(1000);
                });
                $('<p>Εμφανίζεσαι πάλι στον αρχικό διάδρομο. Δεν θα συνηθίσεις ποτέ το σκοτάδι. Δίπλα σου, στο Βορρά, βρίσκεται μια πόρτα, ενώ ξέρεις πως στην άλλη άκρη του διαδρόμου, προς το Νότο, βρίσκεται το μπουντρούμι από όπου ξεκίνησες. Η εικόνα του πολεμιστή του φωτός σου έχει χαραχτεί στο μυαλό. Ποιός να ήταν άραγε;</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Η τραπεζαρία έχει μόνο δύο πόρτες, προς το Βορρά και τη Δύση.</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area4") {
            if (word1 == "south") {
                currentroom = "area2";
                $("#area_4").fadeOut(1000, function() {
                    $("#area_2").fadeIn(1000);
                });
                $('<p>"Στάσου! Μη με αφήνεις πάλι μόνη μου!" ακούς, καθώς κλείνεις πίσω σου την πόρτα. Εμφανίζεσαι πάλι στον αρχικό διάδρομο. Δεν θα συνηθίσεις ποτέ το σκοτάδι. Δίπλα σου, στην Ανατολή, βρίσκεται μια πόρτα, ενώ ξέρεις πως στην άλλη άκρη του διαδρόμου, προς το Νότο, βρίσκεται το μπουντρούμι από όπου ξεκίνησες. Η εικόνα του πολεμιστή του φωτός σου έχει χαραχτεί στο μυαλό. Ποιός να ήταν άραγε;</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Μόνο μια έξοδος, προς το Νότο. Για βοήθεια, σχετικά με τις εντολές, πάτησε "help".</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area5") {
            if (word1 == "north" && area7_visited == false && boss4_answered == false) {
                $('<p>Η πόρτα είναι κλειδωμένη.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area7_visited == false && boss4_answered == true) {
                currentroom = "area7";
                area7_visited = true;
                $("#area_5").fadeOut(1000, function() {
                    $("#area_7").fadeIn(1000);
                });
                $('<p>Βγαίνεις σε μια μεγάλη αίθουσα. Βλέπεις μια τεράστια ξύλινη πύλη. Αν δεν είχες χάσει τις τελευταίες σου ελπίδες, θα πίστευες πως πρόκειται για την έξοδο. Μπροστά της στέκεται μια φρουρός. Καθώς κατεβαίνεις μερικά σκαλιά, την προσοχή σου τραβάει μια ακόμα πόρτα, προς τη Δύση, καθώς παίζει με τις σκιές. "Πρέπει να είναι μαγεία πάλι" σκέφτεσαι. Η φρουρός φαίνεται αρκετά επιθετική. Παρατηρείς ένα περιδέραιο να κρέμεται από το λαιμό της, ενώ τραβάει την κοφτερή λεπίδα της και σε πλησιάζει.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area7_visited == true && boss5_talked == true) {
                currentroom = "area7";
                $("#area_5").fadeOut(1000, function() {
                    $("#area_7").fadeIn(1000);
                });
                $('<p>Βλέπεις την Ίριδα να γυαλίζει το ξίφος της με το ένα χέρι, ενώ με το άλλο κρατάει το κόσμημα στη χούφτα της. Δεν παρατηρείς κάτι διαφορετικό. Πίσω της η μεγάλη πύλη. Έχεις πεθυμήσει τον έξω κόσμο.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && area7_visited == true && boss5_talked == false) {
                currentroom = "area7";
                $("#area_5").fadeOut(1000, function() {
                    $("#area_7").fadeIn(1000);
                });
                $('<p>Η φρουρός σε κοιτάζει έντονα. Δεν παρατηρείς κάτι διαφορετικό. Πίσω της η μεγάλη πύλη. Έχεις πεθυμήσει τον έξω κόσμο.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "east" && area6_visited == false) {
                area6_visited = true;
                currentroom = "area6";
                $("#area_5").fadeOut(1000, function() {
                    $("#area_6").fadeIn(1000);
                });
                $('<p>Ακολουθείς μια στενή, κυκλική σκάλα προς τα επάνω. Οι πέτρινες σκάλες φαίνεται να φιλοξενούν κάποιους τροκτικούς επισκέπτες. Αφού έχεις ανέβει αρκετά σκαλιά, μπαίνεις σε ένα δωμάτιο. Βλέπεις ένα πλάσμα, κάτι μεταξύ ανθρώπου και δράκου, ξαπλωμένο σε ένα στενό κρεβάτι, με την πλάτη του γυρισμένη προς το μέρος σου. Σου τραβάνε την προσοχή τα φτερά του, με τα κρυστάλλινα λέπια τους. Σε άκουσε αλλά, φαίνεται να αδιαφορεί για την παρουσία σου. Σηκώνεται και κοιτάζει έξω από το παράθυρο, το φεγγάρι.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "east" && area6_visited == true && boss4_talked == true) {
                currentroom = "area6";
                $("#area_5").fadeOut(1000, function() {
                    $("#area_6").fadeIn(1000);
                });
                $('<p>Ανεβαίνεις βιαστικά τη σκάλα. Μπαίνεις στο δωμάτιο του Λάρσεν. Φαίνεται να μη σκέφτεται κάτι. Ίσως,συνειδητά, απολαμβάνει το να μην μπορεί να σκεφτεί. Δεν έχει αλλάξει κάτι στο χώρο από την τελευταία φορά που ήρθες.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "east" && area6_visited == true && boss4_talked == false) {
                currentroom = "area6";
                $("#area_5").fadeOut(1000, function() {
                    $("#area_6").fadeIn(1000);
                });
                $('<p>Ανεβαίνεις βιαστικά τη σκάλα. Μπαίνεις στο δωμάτιο του δρακόμορφου. Παρατηρεί μέσα από ένα παράθυρο, τη νύχτα Δεν έχει αλλάξει κάτι στο χώρο από την τελευταία φορά που ήρθες.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "south") {
                currentroom = "area3";
                $("#area_5").fadeOut(1000, function() {
                    $("#area_3").fadeIn(1000);
                });
                $('<p>Βλέπεις τον φρουρό να κοιμάται."Όπως τον άφησα" σκέφτεσαι.</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Υπάρχουν μόνο τρεις πόρτες στο χώρο. Βορράς, Ανατολή και Νότος. Για βοήθεια, σχετικά με τις εντολές, πάτησε "help".</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area6") {
            if (word1 == "west" && area5_visited == true) {
                currentroom = "area5";
                $("#area_6").fadeOut(1000, function() {
                    $("#area_5").fadeIn(1000);
                });
                $('<p>Βλέπεις τον Εννέα να σκέφτεται, πάνω στη σκακιέρα. Τόσα λίγα πιόνια στη  σκακιέρα κι όμως, τόσοι συνδιασμοί!</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "west" && area5_visited == false) {
                area5_visited = true;
                mysterious_lollipop = true;
                currentroom = "area5";
                $("#area_6").fadeOut(1000, function() {
                    $("#area_5").fadeIn(1000);
                });
                $('<p>Καθώς κατεβαίνεις τα σκαλιά του πύργου, βλέπεις ένα γλυφιτζούρι μέσα στη σκόνη. Μόλις πήρες ένα βρώμικο γλυφιτζούρι. Αηδία! Φτάνεις στο τέλος των σκαλοπατιών, περνάς από το στενό πέρασμα και βλέπεις τον Εννέα σαστισμένο. Εννέα: "Αδύνατον! Η πορτά αυτή ήταν σφραγισμένη! Και έτσι έπρεπε να μείνει." Η πόρτα του δωματίου προς το Βορρά, άνοιξε.</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Σκέφτεσαι να πηδήξεις από το παράθυρο; Η μόνη έξοδος είναι προς τη Δύση.</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area7") {
            if (word1 == "south" && boss6_answered == false) {
                currentroom = "area5";
                $("#area_7").fadeOut(1000, function() {
                    $("#area_5").fadeIn(1000);
                });
                $('<p>Βλέπεις τον Εννέα να σκέφτεται, πάνω στη σκακιέρα. Τι περίπλοκα σχέδια να καταστρώνει;</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "south" && boss6_answered == true) {
                currentroom = "area5";
                $("#area_7").fadeOut(1000, function() {
                    $("#area_5").fadeIn(1000);
                });
                $('<p>Βλέπεις τον Εννέα να ψάχνει μανιωδώς τις σημειώσεις του. Γύρισαν οι αναμνήσεις του;</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "west" && area8_visited == false && ring == false) {
                $('<p>Η μαγεία έχει εξαπλωθεί έως και εδώ. Οι σκιές καλύπτουν την πόρτα και σου στερούν τη δυνατότητα να τις διαπεράσεις. Πρέπει να βρεις άλλο τρόπο να περάσεις από αυτή την πόρτα.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "west" && area8_visited == false && ring == true) {
                area8_visited = true;
                currentroom = "area8";
                $("#area_7").fadeOut(1000, function() {
                    $("#area_8").fadeIn(1000);
                });
                $('<p>Οι σκιές αντιδρούν στην παρουσία σου. Φοράς το Δαχτυλίδι των Ευχών κι ενώ είναι έτοιμες να σε καταπιούν, χάνονται στην όψη του Δαχτυλιδιού. Ανοίγεις την πόρτα και μπαίνεις σε ένα σκοτεινό αλλά επιβλητικό υπνοδωμάτιο. Στρωμένο και καθαρό κρεβάτι. Καθαρά ρούχα μέσα σε μια μεγάλη ντουλάπα, δίπλα σε ένα γραφείο. Το γραφείο έχει ένα σημείωμα πάνω του. "Οι ανόητοι μαθαίνουν από την εμπειρία" διαβάζεις, καθώς σκέφτεσαι πως, ίσως ήρθε η ώρα να ξεκουραστείς. Ένα αεράκι φυσάει και παρακινεί τις κουρτίνες του δωματίου. Η ατμόσφαιρα ξαφνικά γίνεται αποπνικτική, καθώς μια σκιά παίρνει μορφή μπροστά σου. Είχες ακούσει παραμύθια, μα ποτέ σου δεν περίμενες πως θα συναντήσεις ένα πνεύμα.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "west" && area8_visited == true && boss6_answered == false && boss6_talked == true) {
                currentroom = "area8";
                $("#area_7").fadeOut(1000, function() {
                    $("#area_8").fadeIn(1000);
                });
                $('<p>Ο Έρεν σε κοιτάζει λυπημένος. Πρέπει να βρεις τρόπο να τον βοηθήσεις.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "west" && area8_visited == true && boss6_answered == false && boss6_talked == false) {
                currentroom = "area8";
                $("#area_7").fadeOut(1000, function() {
                    $("#area_8").fadeIn(1000);
                });
                $('<p>Νιώθεις την παρουσία του πνεύματος να σε κοιτάζει.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "west" && area8_visited == true && boss6_answered == true) {
                currentroom = "area8";
                $("#area_7").fadeOut(1000, function() {
                    $("#area_8").fadeIn(1000);
                });
                $('<p>Αναρωτιέσαι τι να σκέφτεται ο Έρεν, καθώς κοιτάζει έξω από το παράθυρο. Ίσως απλά να απολαμβάνει τη θέα, ως άνθρωπος.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && key_5 == false) {
                $('<p>Η πύλη είναι κλειδωμένη. Είσαι τόσο κοντά κι όμως, τόσο μακριά.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "north" && key_5 == true) {
                currentroom = "area9";
                $("#area_7").fadeOut(1000, function() {
                    $("#area_9").fadeIn(1000);
                });
                $('<p>Επιτέλους, για πρώτη φορά μετά από τόσο καιρό, μπορείς να απολαύσεις το φως του ήλιου. Ένα ελαφρύ αεράκι, διασχίζοντας το δάσος, δροσίζει απαλά μια γέρικη κερασιά. "Πέντε εκατοστά το δευτερόλεπτο" ακούγεται μια φωνή από δίπλα σου. Μαγεμένος από τον αρμονικό χορό των πετάλων, γυρίζεις να κοιτάξεις από πού προέρχεται εκείνη η φωνή. Δε βλέπεις κάτι. "Τα φύλλα του δένδρου, πέφτουν πέντε εκατοστά το δευτερόλεπτο", φωνάζει η ίδια φωνή, από το Βορρά αυτή το φορά, και συνεχίζει "Κι όμως, πέφτουν κι έπειτα, χάνονται". </p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Οι επιλογές σου είναι Βορράς, Νότος και Δύση.</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area8") {
            if (word1 == "east" && boss6_answered == false) {
                $("#area_8").fadeOut(1000, function() {
                    $("#area_7").fadeIn(1000);
                });
                currentroom = "area7";
                $('<p>Βλέπεις την Ίριδα να γυαλίζει το ξίφος της με το ένα χέρι, ενώ με το άλλο κρατάει το κόσμημα στη χούφτα της. Δεν παρατηρείς κάτι διαφορετικό.</p>').insertBefore("#add_text").fadeIn(1000);
            } else if (word1 == "east" && boss6_answered == true) {
                $("#area_8").fadeOut(1000, function() {
                    $("#area_7").fadeIn(1000);
                });
                currentroom = "area7";
                $('<p>Ίριδα: "Τον έσωσες". Διστάζεις και απαντάς καταφατικά. Ίριδα: "Ώστε, αυτό ήταν". Απαντάς: "Σωστά. Πριν φύγω όμως, απάντησε μου, τι σημαίνει αυτό για σένα;" ενώ δείχνεις το περιδέραιο της. Ίριδα: "Αυτό; Αυτό είναι οι στάχτες μου! Είναι κομμάτια μου που κάηκαν, ράγισαν και σκίστηκαν. Δεν ξέρω γιατί τα κρατάω. Με βαραίνουν όποτε προσπαθώ να ξεφύγω, από όσα έχω ζήσει. Αλλά μην ανησυχείς. Δεν σκοπεύω να συνεχίσω να ζω έτσι. Όχι μετά από όσα έκανες για εμάς."</p>').insertBefore("#add_text").fadeIn(1000);
            } else {
                $('<p>Δεν υπάρχει άλλη πόρτα. Μόνο εκείνη, από όπου ήρθες, προς την Ανατολή.</p>').insertBefore("#add_text").fadeIn(1000);
            }
        } else if (currentroom == "area0") {
            $('<p>Για να ξεκινήσει η περιπέτειά σου, πάτησε "start".</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area9" && word1 != "north") {
            $('<p>Η περιπέτεια συνεχίζεται στο Βορρά.</p>').insertBefore("#add_text").fadeIn(1000);
        } else if (currentroom == "area9" && word1 == "north") {
            $('<p>Τα βήματά σου προς το Βορρά, συναντούν μια ξύλινη πινακίδα. Προσπαθείς να διαβάσεις τα μεγάλα γράμματά της, βαμμένα με ολόφρεσκη μπογιά.</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>--------------------------------</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>Έφτασες στο τέλος της περιπέτειας σου.</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>Στην πραγματικότητα, ο Λάρσεν, αφού επέστρεψαν οι αναμνήσεις του, συγχώρεσε τον παιδικό του φίλο, Λάσκερ. Οι δυο τους άνοιξαν ένα πανδοχείο σε μια μακρινή πόλη. Όσο για τη Μοίρα, μην ανησυχείς. Φαίνεται να απολαμβάνει την παρέα του Εννέα στο κάστρο. Φυσικά, ακόμα να τον κερδίσει στο σκάκι. Η Ίριδα άφησε πίσω της το περιδέραιο και ξεκίνησε να ακολουθεί το ίχνος που άφηναν τα ατελείωτα ηλιοβασιλέματα του μαγικού κόσμου. Θυμάσαι τον ιππότη του φωτός που συνάντησες στην αρχή του παιχνιδιού; Εκείνον και τον Έρεν, ίσως, τους συναντήσεις πάλι στο μέλλον, σε κάποια νέα περιπέτεια.</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>Αλλά όλοι έζησαν καλά</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>κι εμείς</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>καλύτερα.</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>Love,</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>-The Unknown Sign Painter</p>').insertBefore("#add_text").fadeIn(1000);
            $('<p>------------ The End ------------</p>').insertBefore("#add_text").fadeIn(1000);
        } else $('<p>Πληκτρολόγησες κάποια κατεύθυνση λάθος. Οι σωστοί προορισμοί είναι "north", "east", "south" και "west". Για παράδειγμα "go south".</p>').insertBefore("#add_text").fadeIn(1000);
    }
    //
    //end go
    //


    //
    //inventory
    //
    else if (words.length == 1 && word0 == "inventory") {
        if (compass == true) {
            compass_str = "Πυξίδα<br>";
        } else {
            compass_str = "";
        }
        if (magic_wand == true) {
            magic_wand_str = "Μαγικό ραβδί παγωμένης έκρηξης<br>";
        } else {
            magic_wand_str = "";
        }
        if (key_1 == true) {
            key_1_str = "Σκουριασμένο κλειδί<br>";
        } else {
            key_1_str = "";
        }
        if (key_2 == true) {
            key_2_str = "Ασημένιο κλειδί<br>";
        } else {
            key_2_str = "";
        }
        if (key_3 == true) {
            key_3_str = "Χρυσό κλειδί σε σχήμα δράκου<br>";
        } else {
            key_3_str = "";
        }
        if (key_4 == true) {
            key_4_str = "Χρυσό κλειδί σε σχήμα αράχνης<br>";
        } else {
            key_4_str = "";
        }
        if (key_5 == true) {
            key_5_str = "Κλειδί στολισμένο με ζαφείρια και ρουμπίνια<br>";
        } else {
            key_5_str = "";
        }
        if (mysterious_lollipop == true) {
            mysterious_lollipop_str = "Μυστηριώδες γλυφιτζούρι<br>";
        } else {
            mysterious_lollipop_str = "";
        }

        if (compass_str == "" && magic_wand_str == "" && key_1_str == "" && key_2_str == "" && key_3_str == "" && key_4_str == "" && key_5_str == "" && mysterious_lollipop_str == "") {
            $('<p>Inventory:<br /><i>Το σακίδιό σου είναι άδειο</i></p>').insertBefore("#add_text").fadeIn(1000);
        } else {
            $('<p>Inventory:<br>' + compass_str + magic_wand_str + key_1_str + key_2_str + key_3_str + key_4_str + mysterious_lollipop_str + '</p>').insertBefore("#add_text").fadeIn(1000);
        }
    }
    //
    //end inventory
    //
    else if (input != "") {
        $('<p>Δεν καταλαβαίνω τη συγκεκριμένη εντολή. Για βοήθεια σχετικά με τις εντολές, πάτησε "help".</p>').insertBefore("#add_text").fadeIn(1000);
    }
    $(".text").scrollTop($(".text")[0].scrollHeight - ($(".text>p:nth-last-child(2)").height() + $(".area_title").height()));
    $("#command_line").val("");
});